graph(%self : __torch__.ScriptableAdapter,
      %inputs.1 : (Dict(str, Tensor))):
  %2 : bool = prim::Constant[value=1]() # /home/kelechi/detectron2/tools/deploy/export_model.py:90:23
  %3 : NoneType = prim::Constant()
  %4 : bool = prim::Constant[value=0]() # /home/kelechi/detectron2/tools/deploy/export_model.py:89:72
  %model : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self)
  %6 : Dict(str, Tensor) = prim::TupleUnpack(%inputs.1)
  %7 : Dict(str, Tensor)[] = prim::ListConstruct(%6)
  %15 : str = prim::Constant[value="Empty Instances does not support __len__!"]() # /tmp/detectron2ixyxk_co/tmph4ywe4hk.py:173:34
  %16 : float = prim::Constant[value=1e-08]() # /home/kelechi/detectron2/detectron2/modeling/poolers.py:54:70
  %17 : str = prim::Constant[value="AssertionError: The shape of the tensor in the boxes list is not correct as List[Tensor[L, 4]]"]()
  %18 : str = prim::Constant[value="AssertionError: The boxes tensor shape is not correct as Tensor[K, 5]"]()
  %19 : str = prim::Constant[value="AssertionError: proposal_boxes is None and cannot be accessed!"]()
  %20 : str = prim::Constant[value="AssertionError: pred_boxes is None and cannot be accessed!"]()
  %21 : str = prim::Constant[value="AssertionError: pred_classes is None and cannot be accessed!"]()
  %22 : int = prim::Constant[value=6]() # /home/kelechi/detectron2/detectron2/modeling/anchor_generator.py:44:78
  %23 : str = prim::Constant[value="Indexing on Boxes with {} failed to return a matrix!"]() # /home/kelechi/detectron2/detectron2/structures/boxes.py:236:29
  %24 : str = prim::Constant[value="AssertionError: Box tensor contains infinite or NaN!"]()
  %25 : str = prim::Constant[value="cpu"]() # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torchvision/ops/boxes.py:72:53
  %26 : int = prim::Constant[value=4000]() # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torchvision/ops/boxes.py:72:24
  %27 : int = prim::Constant[value=20000]() # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torchvision/ops/boxes.py:72:64
  %28 : int = prim::Constant[value=11]() # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torchvision/ops/boxes.py:106:47
  %29 : (str, str, str, str, str, str, str, str) = prim::Constant[value=("proposal_boxes", "objectness_logits", "pred_boxes", "scores", "pred_classes", "pred_masks", "pred_keypoints", "pred_keypoint_heatmaps")]()
  %30 : float = prim::Constant[value=0.5]() # /home/kelechi/detectron2/detectron2/modeling/box_regression.py:93:30
  %31 : int = prim::Constant[value=-4]()
  %32 : int = prim::Constant[value=-3]()
  %33 : str = prim::Constant[value="nearest"]() # /home/kelechi/detectron2/detectron2/modeling/backbone/fpn.py:153:88
  %34 : float = prim::Constant[value=2.]() # /home/kelechi/detectron2/detectron2/modeling/backbone/fpn.py:153:78
  %35 : int = prim::Constant[value=3]() # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:358:40
  %36 : int = prim::Constant[value=2]() # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:358:50
  %37 : float = prim::Constant[value=0.10000000000000001]()
  %38 : str = prim::Constant[value="ResNet takes an input of shape (N, C, H, W). Got {} instead!"]() # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:443:29
  %39 : str = prim::Constant[value="stem"]() # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:446:11
  %40 : int = prim::Constant[value=5]() # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:4051:22
  %41 : str = prim::Constant[value="builtins.NotImplementedError"]() # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:4098:14
  %42 : str = prim::Constant[value="Input Error: Only 3D, 4D and 5D input Tensors supported (got {}D) for the modes: nearest | linear | bilinear | bicubic | trilinear | area | nearest-exact (got {})"]() # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:4111:8
  %43 : float = prim::Constant[value=0.]()
  %44 : int = prim::Constant[value=1]()
  %45 : str = prim::Constant[value="image"]() # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:227:49
  %46 : bool = prim::Constant[value=0]()
  %47 : str = prim::Constant[value="square_size"]() # /home/kelechi/detectron2/detectron2/modeling/backbone/fpn.py:124:16
  %48 : int = prim::Constant[value=9223372036854775807]() # /home/kelechi/detectron2/detectron2/structures/image_list.py:124:26
  %49 : int = prim::Constant[value=0]() # /home/kelechi/detectron2/detectron2/structures/image_list.py:81:30
  %50 : str = prim::Constant[value="AssertionError: "]()
  %51 : int = prim::Constant[value=-2]() # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:28
  %52 : int = prim::Constant[value=-1]() # /home/kelechi/detectron2/detectron2/structures/image_list.py:87:47
  %53 : str = prim::Constant[value="size_divisibility"]() # /home/kelechi/detectron2/detectron2/structures/image_list.py:96:15
  %54 : str = prim::Constant[value="floor"]() # /home/kelechi/detectron2/detectron2/structures/image_list.py:101:75
  %55 : int = prim::Constant[value=4]() # /home/kelechi/detectron2/detectron2/structures/image_list.py:105:52
  %56 : str = prim::Constant[value="constant"]()
  %57 : NoneType = prim::Constant() # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:206:33
  %58 : bool = prim::Constant[value=1]() # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:215:33
  %59 : str = prim::Constant[value="AssertionError: Scripting is not supported for postprocess."]()
  %images.1 : Tensor[] = prim::ListConstruct()
  %61 : int = aten::len(%7) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:227:17
   = prim::Loop(%61, %58) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:227:17
    block0(%62 : int):
      %x.45 : Dict(str, Tensor) = aten::__getitem__(%7, %62) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:227:17
      %64 : Tensor = aten::__getitem__(%x.45, %45) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:227:47
      %pixel_mean.2 : Tensor = prim::GetAttr[name="pixel_mean"](%model)
      %66 : Device = prim::device(%pixel_mean.2)
      %67 : Tensor = aten::to(%64, %66, %57, %46, %46) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:177:11
      %68 : Tensor[] = aten::append(%images.1, %67) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:227:17
      -> (%58)
  %images.5 : Tensor[] = prim::ListConstruct()
  %70 : int = aten::len(%images.1) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:228:17
   = prim::Loop(%70, %58) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:228:17
    block0(%71 : int):
      %x.39 : Tensor = aten::__getitem__(%images.1, %71) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:228:17
      %pixel_mean.1 : Tensor = prim::GetAttr[name="pixel_mean"](%model)
      %74 : Tensor = aten::sub(%x.39, %pixel_mean.1, %44) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:228:19
      %pixel_std : Tensor = prim::GetAttr[name="pixel_std"](%model)
      %76 : Tensor = aten::div(%74, %pixel_std) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:228:19
      %77 : Tensor[] = aten::append(%images.5, %76) # /home/kelechi/detectron2/detectron2/modeling/meta_arch/rcnn.py:228:17
      -> (%58)
  %backbone.1 : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%model)
  %_size_divisibility : int = prim::GetAttr[name="_size_divisibility"](%backbone.1)
  %backbone : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%model)
  %_square_pad : int = prim::GetAttr[name="_square_pad"](%backbone)
  %82 : Dict(str, int) = prim::DictConstruct(%47, %_square_pad)
  %83 : int = aten::len(%images.5) # /home/kelechi/detectron2/detectron2/structures/image_list.py:81:15
  %84 : bool = aten::gt(%83, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:81:15
   = prim::If(%84) # /home/kelechi/detectron2/detectron2/structures/image_list.py:81:8
    block0():
      -> ()
    block1():
       = prim::RaiseException(%50, %57) # /home/kelechi/detectron2/detectron2/structures/image_list.py:81:8
      -> ()
  %85 : int = aten::len(%images.5) # /home/kelechi/detectron2/detectron2/structures/image_list.py:83:8
   = prim::Loop(%85, %58) # /home/kelechi/detectron2/detectron2/structures/image_list.py:83:8
    block0(%86 : int):
      %t.4 : Tensor = aten::__getitem__(%images.5, %86) # /home/kelechi/detectron2/detectron2/structures/image_list.py:83:8
      %88 : int[] = aten::size(%t.4) # <string>:13:9
      %89 : int[] = aten::slice(%88, %57, %51, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:19
      %90 : Tensor = aten::__getitem__(%images.5, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:35
      %91 : int[] = aten::size(%90) # <string>:13:9
      %92 : int[] = aten::slice(%91, %57, %51, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:35
      %93 : bool = aten::eq(%89, %92) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:19
       = prim::If(%93) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:12
        block0():
          -> ()
        block1():
          %94 : int[] = aten::size(%t.4) # <string>:13:9
          %95 : str = aten::str(%94) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:12
          %96 : str = aten::add(%50, %95) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:12
           = prim::RaiseException(%96, %57) # /home/kelechi/detectron2/detectron2/structures/image_list.py:85:12
          -> ()
      -> (%58)
  %image_sizes.1 : (int, int)[] = prim::ListConstruct()
  %98 : int = aten::len(%images.5) # /home/kelechi/detectron2/detectron2/structures/image_list.py:87:22
   = prim::Loop(%98, %58) # /home/kelechi/detectron2/detectron2/structures/image_list.py:87:22
    block0(%99 : int):
      %im.1 : Tensor = aten::__getitem__(%images.5, %99) # /home/kelechi/detectron2/detectron2/structures/image_list.py:87:22
      %101 : int[] = aten::size(%im.1) # <string>:13:9
      %102 : int = aten::__getitem__(%101, %51) # /home/kelechi/detectron2/detectron2/structures/image_list.py:87:24
      %103 : int[] = aten::size(%im.1) # <string>:13:9
      %104 : int = aten::__getitem__(%103, %52) # /home/kelechi/detectron2/detectron2/structures/image_list.py:87:38
      %105 : (int, int) = prim::TupleConstruct(%102, %104)
      %106 : (int, int)[] = aten::append(%image_sizes.1, %105) # /home/kelechi/detectron2/detectron2/structures/image_list.py:87:22
      -> (%58)
  %image_sizes_tensor.1 : Tensor[] = prim::ListConstruct()
  %108 : int = aten::len(%image_sizes.1) # /home/kelechi/detectron2/detectron2/structures/image_list.py:88:29
   = prim::Loop(%108, %58) # /home/kelechi/detectron2/detectron2/structures/image_list.py:88:29
    block0(%109 : int):
      %x.41 : (int, int) = aten::__getitem__(%image_sizes.1, %109) # /home/kelechi/detectron2/detectron2/structures/image_list.py:88:29
      %111 : int, %112 : int = prim::TupleUnpack(%x.41)
      %113 : int[] = prim::ListConstruct(%111, %112)
      %114 : Tensor = aten::as_tensor(%113, %57, %57) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:29:15
      %115 : Tensor[] = aten::append(%image_sizes_tensor.1, %114) # /home/kelechi/detectron2/detectron2/structures/image_list.py:88:29
      -> (%58)
  %116 : Tensor = aten::stack(%image_sizes_tensor.1, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:89:19
  %117 : Tensor, %118 : Tensor = aten::max(%116, %49, %46) # /home/kelechi/detectron2/detectron2/structures/image_list.py:89:19
  %square_size.1 : int = aten::get(%82, %47, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:92:26
  %120 : bool = aten::gt(%square_size.1, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:93:15
   = prim::If(%120) # /home/kelechi/detectron2/detectron2/structures/image_list.py:93:12
    block0():
      %121 : Tensor = aten::select(%117, %49, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:95:16
      %122 : int = prim::dtype(%121)
      %123 : Device = prim::device(%121)
      %124 : Tensor = aten::tensor(%square_size.1, %122, %123, %46)
      %125 : Tensor = aten::copy_(%121, %124, %46) # /home/kelechi/detectron2/detectron2/structures/image_list.py:95:16
      %126 : Tensor = aten::select(%117, %49, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:95:30
      %127 : int = prim::dtype(%126)
      %128 : Device = prim::device(%126)
      %129 : Tensor = aten::tensor(%square_size.1, %127, %128, %46)
      %130 : Tensor = aten::copy_(%126, %129, %46) # /home/kelechi/detectron2/detectron2/structures/image_list.py:95:16
      -> ()
    block1():
      -> ()
  %131 : bool = aten::__contains__(%82, %53) # /home/kelechi/detectron2/detectron2/structures/image_list.py:96:15
  %size_divisibility.27 : int = prim::If(%131) # /home/kelechi/detectron2/detectron2/structures/image_list.py:96:12
    block0():
      %size_divisibility.3 : int = aten::__getitem__(%82, %53) # /home/kelechi/detectron2/detectron2/structures/image_list.py:97:36
      -> (%size_divisibility.3)
    block1():
      -> (%_size_divisibility)
  %134 : bool = aten::gt(%size_divisibility.27, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:98:11
  %max_size : Tensor = prim::If(%134) # /home/kelechi/detectron2/detectron2/structures/image_list.py:98:8
    block0():
      %136 : int = aten::sub(%size_divisibility.27, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:101:36
      %137 : Tensor = aten::add(%117, %136, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:101:24
      %138 : Tensor = aten::div(%137, %size_divisibility.27, %54) # /home/kelechi/detectron2/detectron2/structures/image_list.py:101:24
      %max_size.9 : Tensor = aten::mul(%138, %size_divisibility.27) # /home/kelechi/detectron2/detectron2/structures/image_list.py:101:24
      -> (%max_size.9)
    block1():
      -> (%117)
  %140 : Tensor = aten::to(%max_size, %55, %46, %46, %57) # /home/kelechi/detectron2/detectron2/structures/image_list.py:105:34
  %max_size.25 : int[] = prim::tolist(%140, %44, %49)
  %142 : int = aten::len(%images.5) # /home/kelechi/detectron2/detectron2/structures/image_list.py:110:11
  %143 : bool = aten::eq(%142, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:110:11
  %batched_imgs : Tensor = prim::If(%143) # /home/kelechi/detectron2/detectron2/structures/image_list.py:110:8
    block0():
      %image_size.2 : (int, int) = aten::__getitem__(%image_sizes.1, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:113:25
      %146 : int = aten::__getitem__(%max_size.25, %52) # /home/kelechi/detectron2/detectron2/structures/image_list.py:114:31
      %147 : int = prim::TupleIndex(%image_size.2, %44)
      %148 : int = aten::sub(%146, %147) # /home/kelechi/detectron2/detectron2/structures/image_list.py:114:31
      %149 : int = aten::__getitem__(%max_size.25, %51) # /home/kelechi/detectron2/detectron2/structures/image_list.py:114:64
      %150 : int = prim::TupleIndex(%image_size.2, %49)
      %151 : int = aten::sub(%149, %150) # /home/kelechi/detectron2/detectron2/structures/image_list.py:114:64
      %padding_size.1 : int[] = prim::ListConstruct(%49, %148, %49, %151)
      %153 : Tensor = aten::__getitem__(%images.5, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:115:33
      %154 : Tensor = aten::pad(%153, %padding_size.1, %56, %43) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:4552:11
      %batched_imgs.1 : Tensor = aten::unsqueeze_(%154, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:115:27
      -> (%batched_imgs.1)
    block1():
      %156 : int = aten::len(%images.5) # /home/kelechi/detectron2/detectron2/structures/image_list.py:118:27
      %157 : int[] = prim::ListConstruct(%156)
      %158 : Tensor = aten::__getitem__(%images.5, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:118:48
      %159 : int[] = aten::size(%158) # <string>:13:9
      %160 : int[] = aten::slice(%159, %57, %51, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:118:48
      %161 : int[] = aten::list(%160) # /home/kelechi/detectron2/detectron2/structures/image_list.py:118:43
      %162 : int[] = aten::add(%157, %161) # /home/kelechi/detectron2/detectron2/structures/image_list.py:118:26
      %163 : int[] = aten::list(%max_size.25) # /home/kelechi/detectron2/detectron2/structures/image_list.py:118:73
      %batch_shape.1 : int[] = aten::add(%162, %163) # /home/kelechi/detectron2/detectron2/structures/image_list.py:118:26
      %165 : Tensor = aten::__getitem__(%images.5, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:122:27
      %batched_imgs.3 : Tensor = aten::new_full(%165, %batch_shape.1, %43, %57, %57, %57, %57) # /home/kelechi/detectron2/detectron2/structures/image_list.py:122:27
      %167 : Tensor = aten::__getitem__(%images.5, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:123:58
      %168 : Device = prim::device(%167)
      %batched_imgs.7 : Tensor = aten::to(%batched_imgs.3, %168, %57, %46, %46) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:177:11
      %170 : int = aten::len(%images.5) # /home/kelechi/detectron2/detectron2/structures/image_list.py:124:12
      %171 : int[] = prim::ListConstruct(%48, %170)
      %172 : int = prim::min(%171) # /home/kelechi/detectron2/detectron2/structures/image_list.py:124:12
       = prim::Loop(%172, %58) # /home/kelechi/detectron2/detectron2/structures/image_list.py:124:12
        block0(%i.3 : int):
          %img.1 : Tensor = aten::__getitem__(%images.5, %i.3) # /home/kelechi/detectron2/detectron2/structures/image_list.py:124:12
          %175 : Tensor = aten::select(%batched_imgs.7, %49, %i.3) # /home/kelechi/detectron2/detectron2/structures/image_list.py:127:16
          %176 : int[] = aten::size(%img.1) # <string>:13:9
          %177 : int = aten::__getitem__(%176, %51) # /home/kelechi/detectron2/detectron2/structures/image_list.py:127:39
          %178 : Tensor = aten::slice(%175, %51, %57, %177, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:127:16
          %179 : int[] = aten::size(%img.1) # <string>:13:9
          %180 : int = aten::__getitem__(%179, %52) # /home/kelechi/detectron2/detectron2/structures/image_list.py:127:56
          %181 : Tensor = aten::slice(%178, %52, %57, %180, %44) # /home/kelechi/detectron2/detectron2/structures/image_list.py:127:16
          %182 : Tensor = aten::copy_(%181, %img.1, %46) # /home/kelechi/detectron2/detectron2/structures/image_list.py:127:16
          -> (%58)
      -> (%batched_imgs.7)
  %183 : Tensor = aten::contiguous(%batched_imgs, %49) # /home/kelechi/detectron2/detectron2/structures/image_list.py:129:25
  %images.2 : __torch__.detectron2.structures.image_list.ImageList = prim::CreateObject() # /home/kelechi/detectron2/detectron2/structures/image_list.py:129:15
   = prim::SetAttr[name="tensor"](%images.2, %183)
   = prim::SetAttr[name="image_sizes"](%images.2, %image_sizes.1)
  %backbone.2 : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%model)
  %tensor.43 : Tensor = prim::GetAttr[name="tensor"](%images.2)
  %bottom_up : __torch__.detectron2.modeling.backbone.resnet.ResNet = prim::GetAttr[name="bottom_up"](%backbone.2)
  %188 : int = aten::dim(%tensor.43) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:443:15
  %189 : bool = aten::eq(%188, %55) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:443:15
   = prim::If(%189) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:443:8
    block0():
      -> ()
    block1():
      %190 : int[] = aten::size(%tensor.43) # <string>:13:9
      %191 : str = aten::format(%38, %190) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:443:29
      %192 : str = aten::add(%50, %191) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:443:8
       = prim::RaiseException(%192, %57) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:443:8
      -> ()
  %bottom_up_features.1 : Dict(str, Tensor) = prim::DictConstruct()
  %stem : __torch__.detectron2.modeling.backbone.resnet.BasicStem = prim::GetAttr[name="stem"](%bottom_up)
  %conv1.2 : __torch__.detectron2.layers.wrappers.Conv2d = prim::GetAttr[name="conv1"](%stem)
  %weight.21 : Tensor = prim::GetAttr[name="weight"](%conv1.2)
  %bias.34 : Tensor? = prim::GetAttr[name="bias"](%conv1.2)
  %198 : int[] = prim::ListConstruct(%36, %36)
  %199 : int[] = prim::ListConstruct(%35, %35)
  %200 : int[] = prim::ListConstruct(%44, %44)
  %x.49 : Tensor = aten::conv2d(%tensor.43, %weight.21, %bias.34, %198, %199, %200, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.7 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv1.2)
  %203 : bool = prim::requires_grad(%x.49)
  %x.83 : Tensor = prim::If(%203) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.23 : Tensor = prim::GetAttr[name="weight"](%norm.7)
      %running_var.14 : Tensor = prim::GetAttr[name="running_var"](%norm.7)
      %eps.14 : float = prim::GetAttr[name="eps"](%norm.7)
      %208 : Tensor = aten::add(%running_var.14, %eps.14, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %209 : Tensor = aten::rsqrt(%208) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.4 : Tensor = aten::mul(%weight.23, %209) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.36 : Tensor = prim::GetAttr[name="bias"](%norm.7)
      %running_mean.14 : Tensor = prim::GetAttr[name="running_mean"](%norm.7)
      %213 : Tensor = aten::mul(%running_mean.14, %scale.4) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.38 : Tensor = aten::sub(%bias.36, %213, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %215 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.18 : Tensor = aten::reshape(%scale.4, %215) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %217 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.40 : Tensor = aten::reshape(%bias.38, %217) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.8 : int = prim::dtype(%x.49)
      %220 : Tensor = aten::to(%scale.18, %out_dtype.8, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %221 : Tensor = aten::mul(%x.49, %220) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %222 : Tensor = aten::to(%bias.40, %out_dtype.8, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %223 : Tensor = aten::add(%221, %222, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%223)
    block1():
      %running_mean.16 : Tensor = prim::GetAttr[name="running_mean"](%norm.7)
      %running_var.16 : Tensor = prim::GetAttr[name="running_var"](%norm.7)
      %weight.25 : Tensor = prim::GetAttr[name="weight"](%norm.7)
      %bias.42 : Tensor = prim::GetAttr[name="bias"](%norm.7)
      %eps.16 : float = prim::GetAttr[name="eps"](%norm.7)
      %229 : Tensor = aten::batch_norm(%x.49, %weight.25, %bias.42, %running_mean.16, %running_var.16, %46, %37, %eps.16, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%229)
  %x.61 : Tensor = aten::relu_(%x.83) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:357:12
  %231 : int[] = prim::ListConstruct(%35, %35)
  %232 : int[] = prim::ListConstruct(%36, %36)
  %233 : int[] = prim::ListConstruct(%44, %44)
  %234 : int[] = prim::ListConstruct(%44, %44)
  %x.79 : Tensor = aten::max_pool2d(%x.61, %231, %232, %233, %234, %46) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:796:11
  %_out_features.1 : str[] = prim::GetAttr[name="_out_features"](%bottom_up)
  %237 : bool = aten::__contains__(%_out_features.1, %39) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:446:11
   = prim::If(%237) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:446:8
    block0():
       = aten::_set_item(%bottom_up_features.1, %39, %x.79) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:447:12
      -> ()
    block1():
      -> ()
  %stage_names : (str, str, str, str) = prim::GetAttr[name="stage_names"](%bottom_up)
  %name.1 : str, %name.7 : str, %name.13 : str, %name.19 : str = prim::TupleUnpack(%stage_names)
  %stages : __torch__.torch.nn.modules.container.ModuleList = prim::GetAttr[name="stages"](%bottom_up)
  %_0.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="0"](%stages)
  %_1.1 : __torch__.torch.nn.modules.container.___torch_mangle_12.Sequential = prim::GetAttr[name="1"](%stages)
  %_2.1 : __torch__.torch.nn.modules.container.___torch_mangle_20.Sequential = prim::GetAttr[name="2"](%stages)
  %_3.1 : __torch__.torch.nn.modules.container.___torch_mangle_28.Sequential = prim::GetAttr[name="3"](%stages)
  %_0.3 : __torch__.detectron2.modeling.backbone.resnet.BottleneckBlock = prim::GetAttr[name="0"](%_0.1)
  %_1.3 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_4.BottleneckBlock = prim::GetAttr[name="1"](%_0.1)
  %_2.3 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_4.BottleneckBlock = prim::GetAttr[name="2"](%_0.1)
  %conv1.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_1.Conv2d = prim::GetAttr[name="conv1"](%_0.3)
  %weight.27 : Tensor = prim::GetAttr[name="weight"](%conv1.4)
  %bias.44 : Tensor? = prim::GetAttr[name="bias"](%conv1.4)
  %254 : int[] = prim::ListConstruct(%44, %44)
  %255 : int[] = prim::ListConstruct(%49, %49)
  %256 : int[] = prim::ListConstruct(%44, %44)
  %x.59 : Tensor = aten::conv2d(%x.79, %weight.27, %bias.44, %254, %255, %256, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.9 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv1.4)
  %259 : bool = prim::requires_grad(%x.59)
  %out.3 : Tensor = prim::If(%259) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.29 : Tensor = prim::GetAttr[name="weight"](%norm.9)
      %running_var.18 : Tensor = prim::GetAttr[name="running_var"](%norm.9)
      %eps.18 : float = prim::GetAttr[name="eps"](%norm.9)
      %264 : Tensor = aten::add(%running_var.18, %eps.18, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %265 : Tensor = aten::rsqrt(%264) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.20 : Tensor = aten::mul(%weight.29, %265) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.46 : Tensor = prim::GetAttr[name="bias"](%norm.9)
      %running_mean.18 : Tensor = prim::GetAttr[name="running_mean"](%norm.9)
      %269 : Tensor = aten::mul(%running_mean.18, %scale.20) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.48 : Tensor = aten::sub(%bias.46, %269, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %271 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.22 : Tensor = aten::reshape(%scale.20, %271) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %273 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.50 : Tensor = aten::reshape(%bias.48, %273) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.10 : int = prim::dtype(%x.59)
      %276 : Tensor = aten::to(%scale.22, %out_dtype.10, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %277 : Tensor = aten::mul(%x.59, %276) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %278 : Tensor = aten::to(%bias.50, %out_dtype.10, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %279 : Tensor = aten::add(%277, %278, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%279)
    block1():
      %running_mean.20 : Tensor = prim::GetAttr[name="running_mean"](%norm.9)
      %running_var.20 : Tensor = prim::GetAttr[name="running_var"](%norm.9)
      %weight.31 : Tensor = prim::GetAttr[name="weight"](%norm.9)
      %bias.52 : Tensor = prim::GetAttr[name="bias"](%norm.9)
      %eps.20 : float = prim::GetAttr[name="eps"](%norm.9)
      %285 : Tensor = aten::batch_norm(%x.59, %weight.31, %bias.52, %running_mean.20, %running_var.20, %46, %37, %eps.20, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%285)
  %out.7 : Tensor = aten::relu_(%out.3) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:196:14
  %conv2.2 : __torch__.detectron2.layers.wrappers.___torch_mangle_2.Conv2d = prim::GetAttr[name="conv2"](%_0.3)
  %weight.33 : Tensor = prim::GetAttr[name="weight"](%conv2.2)
  %bias.54 : Tensor? = prim::GetAttr[name="bias"](%conv2.2)
  %290 : int[] = prim::ListConstruct(%44, %44)
  %291 : int[] = prim::ListConstruct(%44, %44)
  %292 : int[] = prim::ListConstruct(%44, %44)
  %x.87 : Tensor = aten::conv2d(%out.7, %weight.33, %bias.54, %290, %291, %292, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.11 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv2.2)
  %295 : bool = prim::requires_grad(%x.87)
  %out.11 : Tensor = prim::If(%295) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.35 : Tensor = prim::GetAttr[name="weight"](%norm.11)
      %running_var.22 : Tensor = prim::GetAttr[name="running_var"](%norm.11)
      %eps.22 : float = prim::GetAttr[name="eps"](%norm.11)
      %300 : Tensor = aten::add(%running_var.22, %eps.22, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %301 : Tensor = aten::rsqrt(%300) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.24 : Tensor = aten::mul(%weight.35, %301) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.56 : Tensor = prim::GetAttr[name="bias"](%norm.11)
      %running_mean.22 : Tensor = prim::GetAttr[name="running_mean"](%norm.11)
      %305 : Tensor = aten::mul(%running_mean.22, %scale.24) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.58 : Tensor = aten::sub(%bias.56, %305, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %307 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.26 : Tensor = aten::reshape(%scale.24, %307) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %309 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.60 : Tensor = aten::reshape(%bias.58, %309) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.12 : int = prim::dtype(%x.87)
      %312 : Tensor = aten::to(%scale.26, %out_dtype.12, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %313 : Tensor = aten::mul(%x.87, %312) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %314 : Tensor = aten::to(%bias.60, %out_dtype.12, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %315 : Tensor = aten::add(%313, %314, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%315)
    block1():
      %running_mean.24 : Tensor = prim::GetAttr[name="running_mean"](%norm.11)
      %running_var.24 : Tensor = prim::GetAttr[name="running_var"](%norm.11)
      %weight.37 : Tensor = prim::GetAttr[name="weight"](%norm.11)
      %bias.62 : Tensor = prim::GetAttr[name="bias"](%norm.11)
      %eps.24 : float = prim::GetAttr[name="eps"](%norm.11)
      %321 : Tensor = aten::batch_norm(%x.87, %weight.37, %bias.62, %running_mean.24, %running_var.24, %46, %37, %eps.24, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%321)
  %out.15 : Tensor = aten::relu_(%out.11) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:199:14
  %conv3.2 : __torch__.detectron2.layers.wrappers.___torch_mangle_0.Conv2d = prim::GetAttr[name="conv3"](%_0.3)
  %weight.39 : Tensor = prim::GetAttr[name="weight"](%conv3.2)
  %bias.64 : Tensor? = prim::GetAttr[name="bias"](%conv3.2)
  %326 : int[] = prim::ListConstruct(%44, %44)
  %327 : int[] = prim::ListConstruct(%49, %49)
  %328 : int[] = prim::ListConstruct(%44, %44)
  %x.32 : Tensor = aten::conv2d(%out.15, %weight.39, %bias.64, %326, %327, %328, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.13 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv3.2)
  %331 : bool = prim::requires_grad(%x.32)
  %out.19 : Tensor = prim::If(%331) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.41 : Tensor = prim::GetAttr[name="weight"](%norm.13)
      %running_var.26 : Tensor = prim::GetAttr[name="running_var"](%norm.13)
      %eps.26 : float = prim::GetAttr[name="eps"](%norm.13)
      %336 : Tensor = aten::add(%running_var.26, %eps.26, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %337 : Tensor = aten::rsqrt(%336) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.28 : Tensor = aten::mul(%weight.41, %337) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.66 : Tensor = prim::GetAttr[name="bias"](%norm.13)
      %running_mean.26 : Tensor = prim::GetAttr[name="running_mean"](%norm.13)
      %341 : Tensor = aten::mul(%running_mean.26, %scale.28) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.68 : Tensor = aten::sub(%bias.66, %341, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %343 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.30 : Tensor = aten::reshape(%scale.28, %343) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %345 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.70 : Tensor = aten::reshape(%bias.68, %345) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.14 : int = prim::dtype(%x.32)
      %348 : Tensor = aten::to(%scale.30, %out_dtype.14, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %349 : Tensor = aten::mul(%x.32, %348) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %350 : Tensor = aten::to(%bias.70, %out_dtype.14, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %351 : Tensor = aten::add(%349, %350, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%351)
    block1():
      %running_mean.28 : Tensor = prim::GetAttr[name="running_mean"](%norm.13)
      %running_var.28 : Tensor = prim::GetAttr[name="running_var"](%norm.13)
      %weight.43 : Tensor = prim::GetAttr[name="weight"](%norm.13)
      %bias.72 : Tensor = prim::GetAttr[name="bias"](%norm.13)
      %eps.28 : float = prim::GetAttr[name="eps"](%norm.13)
      %357 : Tensor = aten::batch_norm(%x.32, %weight.43, %bias.72, %running_mean.28, %running_var.28, %46, %37, %eps.28, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%357)
  %shortcut.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_0.Conv2d = prim::GetAttr[name="shortcut"](%_0.3)
  %weight.45 : Tensor = prim::GetAttr[name="weight"](%shortcut.4)
  %bias.74 : Tensor? = prim::GetAttr[name="bias"](%shortcut.4)
  %361 : int[] = prim::ListConstruct(%44, %44)
  %362 : int[] = prim::ListConstruct(%49, %49)
  %363 : int[] = prim::ListConstruct(%44, %44)
  %x.34 : Tensor = aten::conv2d(%x.79, %weight.45, %bias.74, %361, %362, %363, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.15 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%shortcut.4)
  %366 : bool = prim::requires_grad(%x.34)
  %shortcut.6 : Tensor = prim::If(%366) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.47 : Tensor = prim::GetAttr[name="weight"](%norm.15)
      %running_var.30 : Tensor = prim::GetAttr[name="running_var"](%norm.15)
      %eps.30 : float = prim::GetAttr[name="eps"](%norm.15)
      %371 : Tensor = aten::add(%running_var.30, %eps.30, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %372 : Tensor = aten::rsqrt(%371) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.32 : Tensor = aten::mul(%weight.47, %372) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.76 : Tensor = prim::GetAttr[name="bias"](%norm.15)
      %running_mean.30 : Tensor = prim::GetAttr[name="running_mean"](%norm.15)
      %376 : Tensor = aten::mul(%running_mean.30, %scale.32) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.78 : Tensor = aten::sub(%bias.76, %376, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %378 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.34 : Tensor = aten::reshape(%scale.32, %378) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %380 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.80 : Tensor = aten::reshape(%bias.78, %380) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.16 : int = prim::dtype(%x.34)
      %383 : Tensor = aten::to(%scale.34, %out_dtype.16, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %384 : Tensor = aten::mul(%x.34, %383) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %385 : Tensor = aten::to(%bias.80, %out_dtype.16, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %386 : Tensor = aten::add(%384, %385, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%386)
    block1():
      %running_mean.32 : Tensor = prim::GetAttr[name="running_mean"](%norm.15)
      %running_var.32 : Tensor = prim::GetAttr[name="running_var"](%norm.15)
      %weight.49 : Tensor = prim::GetAttr[name="weight"](%norm.15)
      %bias.82 : Tensor = prim::GetAttr[name="bias"](%norm.15)
      %eps.32 : float = prim::GetAttr[name="eps"](%norm.15)
      %392 : Tensor = aten::batch_norm(%x.34, %weight.49, %bias.82, %running_mean.32, %running_var.32, %46, %37, %eps.32, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%392)
  %out.23 : Tensor = aten::add_(%out.19, %shortcut.6, %44) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:208:8
  %input.6 : Tensor = aten::relu_(%out.23) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:209:14
  %conv1.6 : __torch__.detectron2.layers.wrappers.___torch_mangle_3.Conv2d = prim::GetAttr[name="conv1"](%_1.3)
  %weight.51 : Tensor = prim::GetAttr[name="weight"](%conv1.6)
  %bias.84 : Tensor? = prim::GetAttr[name="bias"](%conv1.6)
  %398 : int[] = prim::ListConstruct(%44, %44)
  %399 : int[] = prim::ListConstruct(%49, %49)
  %400 : int[] = prim::ListConstruct(%44, %44)
  %x.36 : Tensor = aten::conv2d(%input.6, %weight.51, %bias.84, %398, %399, %400, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.17 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv1.6)
  %403 : bool = prim::requires_grad(%x.36)
  %out.25 : Tensor = prim::If(%403) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.53 : Tensor = prim::GetAttr[name="weight"](%norm.17)
      %running_var.34 : Tensor = prim::GetAttr[name="running_var"](%norm.17)
      %eps.34 : float = prim::GetAttr[name="eps"](%norm.17)
      %408 : Tensor = aten::add(%running_var.34, %eps.34, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %409 : Tensor = aten::rsqrt(%408) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.36 : Tensor = aten::mul(%weight.53, %409) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.86 : Tensor = prim::GetAttr[name="bias"](%norm.17)
      %running_mean.34 : Tensor = prim::GetAttr[name="running_mean"](%norm.17)
      %413 : Tensor = aten::mul(%running_mean.34, %scale.36) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.88 : Tensor = aten::sub(%bias.86, %413, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %415 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.38 : Tensor = aten::reshape(%scale.36, %415) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %417 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.90 : Tensor = aten::reshape(%bias.88, %417) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.18 : int = prim::dtype(%x.36)
      %420 : Tensor = aten::to(%scale.38, %out_dtype.18, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %421 : Tensor = aten::mul(%x.36, %420) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %422 : Tensor = aten::to(%bias.90, %out_dtype.18, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %423 : Tensor = aten::add(%421, %422, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%423)
    block1():
      %running_mean.36 : Tensor = prim::GetAttr[name="running_mean"](%norm.17)
      %running_var.36 : Tensor = prim::GetAttr[name="running_var"](%norm.17)
      %weight.55 : Tensor = prim::GetAttr[name="weight"](%norm.17)
      %bias.92 : Tensor = prim::GetAttr[name="bias"](%norm.17)
      %eps.36 : float = prim::GetAttr[name="eps"](%norm.17)
      %429 : Tensor = aten::batch_norm(%x.36, %weight.55, %bias.92, %running_mean.36, %running_var.36, %46, %37, %eps.36, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%429)
  %out.27 : Tensor = aten::relu_(%out.25) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:196:14
  %conv2.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_2.Conv2d = prim::GetAttr[name="conv2"](%_1.3)
  %weight.57 : Tensor = prim::GetAttr[name="weight"](%conv2.4)
  %bias.94 : Tensor? = prim::GetAttr[name="bias"](%conv2.4)
  %434 : int[] = prim::ListConstruct(%44, %44)
  %435 : int[] = prim::ListConstruct(%44, %44)
  %436 : int[] = prim::ListConstruct(%44, %44)
  %x.38 : Tensor = aten::conv2d(%out.27, %weight.57, %bias.94, %434, %435, %436, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.19 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv2.4)
  %439 : bool = prim::requires_grad(%x.38)
  %out.29 : Tensor = prim::If(%439) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.59 : Tensor = prim::GetAttr[name="weight"](%norm.19)
      %running_var.38 : Tensor = prim::GetAttr[name="running_var"](%norm.19)
      %eps.38 : float = prim::GetAttr[name="eps"](%norm.19)
      %444 : Tensor = aten::add(%running_var.38, %eps.38, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %445 : Tensor = aten::rsqrt(%444) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.40 : Tensor = aten::mul(%weight.59, %445) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.96 : Tensor = prim::GetAttr[name="bias"](%norm.19)
      %running_mean.38 : Tensor = prim::GetAttr[name="running_mean"](%norm.19)
      %449 : Tensor = aten::mul(%running_mean.38, %scale.40) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.98 : Tensor = aten::sub(%bias.96, %449, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %451 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.42 : Tensor = aten::reshape(%scale.40, %451) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %453 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.100 : Tensor = aten::reshape(%bias.98, %453) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.20 : int = prim::dtype(%x.38)
      %456 : Tensor = aten::to(%scale.42, %out_dtype.20, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %457 : Tensor = aten::mul(%x.38, %456) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %458 : Tensor = aten::to(%bias.100, %out_dtype.20, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %459 : Tensor = aten::add(%457, %458, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%459)
    block1():
      %running_mean.40 : Tensor = prim::GetAttr[name="running_mean"](%norm.19)
      %running_var.40 : Tensor = prim::GetAttr[name="running_var"](%norm.19)
      %weight.61 : Tensor = prim::GetAttr[name="weight"](%norm.19)
      %bias.102 : Tensor = prim::GetAttr[name="bias"](%norm.19)
      %eps.40 : float = prim::GetAttr[name="eps"](%norm.19)
      %465 : Tensor = aten::batch_norm(%x.38, %weight.61, %bias.102, %running_mean.40, %running_var.40, %46, %37, %eps.40, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%465)
  %out.31 : Tensor = aten::relu_(%out.29) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:199:14
  %conv3.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_0.Conv2d = prim::GetAttr[name="conv3"](%_1.3)
  %weight.63 : Tensor = prim::GetAttr[name="weight"](%conv3.4)
  %bias.104 : Tensor? = prim::GetAttr[name="bias"](%conv3.4)
  %470 : int[] = prim::ListConstruct(%44, %44)
  %471 : int[] = prim::ListConstruct(%49, %49)
  %472 : int[] = prim::ListConstruct(%44, %44)
  %x.40 : Tensor = aten::conv2d(%out.31, %weight.63, %bias.104, %470, %471, %472, %44) # /home/kelechi/detectron2/detectron2/layers/wrappers.py:142:12
  %norm.21 : __torch__.detectron2.layers.batch_norm.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv3.4)
  %475 : bool = prim::requires_grad(%x.40)
  %out.33 : Tensor = prim::If(%475) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:46:8
    block0():
      %weight.65 : Tensor = prim::GetAttr[name="weight"](%norm.21)
      %running_var.42 : Tensor = prim::GetAttr[name="running_var"](%norm.21)
      %eps.42 : float = prim::GetAttr[name="eps"](%norm.21)
      %480 : Tensor = aten::add(%running_var.42, %eps.42, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %481 : Tensor = aten::rsqrt(%480) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:35
      %scale.44 : Tensor = aten::mul(%weight.65, %481) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:49:20
      %bias.106 : Tensor = prim::GetAttr[name="bias"](%norm.21)
      %running_mean.42 : Tensor = prim::GetAttr[name="running_mean"](%norm.21)
      %485 : Tensor = aten::mul(%running_mean.42, %scale.44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:31
      %bias.108 : Tensor = aten::sub(%bias.106, %485, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:50:19
      %487 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %scale.46 : Tensor = aten::reshape(%scale.44, %487) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:51:20
      %489 : int[] = prim::ListConstruct(%44, %52, %44, %44)
      %bias.110 : Tensor = aten::reshape(%bias.108, %489) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:52:19
      %out_dtype.22 : int = prim::dtype(%x.40)
      %492 : Tensor = aten::to(%scale.46, %out_dtype.22, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:23
      %493 : Tensor = aten::mul(%x.40, %492) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      %494 : Tensor = aten::to(%bias.110, %out_dtype.22, %46, %46, %57) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:45
      %495 : Tensor = aten::add(%493, %494, %44) # /home/kelechi/detectron2/detectron2/layers/batch_norm.py:54:19
      -> (%495)
    block1():
      %running_mean.44 : Tensor = prim::GetAttr[name="running_mean"](%norm.21)
      %running_var.44 : Tensor = prim::GetAttr[name="running_var"](%norm.21)
      %weight.67 : Tensor = prim::GetAttr[name="weight"](%norm.21)
      %bias.112 : Tensor = prim::GetAttr[name="bias"](%norm.21)
      %eps.44 : float = prim::GetAttr[name="eps"](%norm.21)
      %501 : Tensor = aten::batch_norm(%x.40, %weight.67, %bias.112, %running_mean.44, %running_var.44, %46, %37, %eps.44, %58) # /home/kelechi/miniconda3/envs/apollo/lib/python3.8/site-packages/torch/nn/functional.py:2512:11
      -> (%501)
  %out.35 : Tensor = aten::add_(%out.33, %input.6, %44) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:208:8
  %input.31 : Tensor = aten::relu_(%out.35) # /home/kelechi/detectron2/detectron2/modeling/backbone/resnet.py:209:14
  %conv1.8 : __torch__.detectron2.layers.wrappers.___torch_mangle_3.Conv2d = prim::GetAttr[name="conv1"](%_2.3)
  %weight.69 : Tensor = prim::GetAttr[name="weight"](%conv1.8)
